<a href="https://colab.research.google.com/github/AmanCSE-1/Computer-Graphics/blob/main/main.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<em><b>Objective :</b> A Financial organization wants to predict the possible defaulters for the consumer loans product. They have data about historic customer behavior based on what they have observed. Hence when they acquire new customers they want to predict who is riskier and who is not.</em>

# Importing Libraries and Loading Dataset

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df =  pd.read_csv('/Dataset.csv')

In [6]:
df.head()

   Id   Income  Age  ...  CURRENT_JOB_YRS CURRENT_HOUSE_YRS Risk_Flag
0   1  1303834   23  ...                3                13         0
1   2  7574516   40  ...                9                13         0
2   3  3991815   66  ...                4                10         0
3   4  6256451   41  ...                2                12         1
4   5  5768871   47  ...                3                14         1

[5 rows x 13 columns]

In [7]:
df.shape

(252000, 13)

In [8]:
df.drop(columns=['Id'], inplace=True)

In [9]:
df.columns

Index(['Income', 'Age', 'Experience', 'Married/Single', 'House_Ownership',
       'Car_Ownership', 'Profession', 'CITY', 'STATE', 'CURRENT_JOB_YRS',
       'CURRENT_HOUSE_YRS', 'Risk_Flag'],
      dtype='object')

In [10]:
df.rename(columns={'CITY':'City',
                   'STATE': 'State', 
                   'Married/Single': 'Marital Status',
                   'CURRENT_HOUSE_YRS': 'Current_House_Years',
                   'CURRENT_JOB_YRS': 'Current_Job_Years'}, inplace=True)

df.columns

Index(['Income', 'Age', 'Experience', 'Marital Status', 'House_Ownership',
       'Car_Ownership', 'Profession', 'City', 'State', 'Current_Job_Years',
       'Current_House_Years', 'Risk_Flag'],
      dtype='object')

## Descriptive Statistics

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252000 entries, 0 to 251999
Data columns (total 12 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Income               252000 non-null  int64
 1   Age                  252000 non-null  int64
 2   Experience           252000 non-null  int64
 3   Marital Status       252000 non-null  object
 4   House_Ownership      252000 non-null  object
 5   Car_Ownership        252000 non-null  object
 6   Profession           252000 non-null  object
 7   City                 252000 non-null  object
 8   State                252000 non-null  object
 9   Current_Job_Years    252000 non-null  int64
 10  Current_House_Years  252000 non-null  int64
 11  Risk_Flag            252000 non-null  int64
dtypes: int64(6), object(6)
memory usage: 23.1+ MB

In [12]:
df.describe()

             Income            Age  ...  Current_House_Years      Risk_Flag
count  2.520000e+05  252000.000000  ...        252000.000000  252000.000000
mean   4.997117e+06      49.954071  ...            11.997794       0.123000
std    2.878311e+06      17.063855  ...             1.399037       0.328438
min    1.031000e+04      21.000000  ...            10.000000       0.000000
25%    2.503015e+06      35.000000  ...            11.000000       0.000000
50%    5.000694e+06      50.000000  ...            12.000000       0.000000
75%    7.477502e+06      65.000000  ...            13.000000       0.000000
max    9.999938e+06      79.000000  ...            14.000000       1.000000

[8 rows x 6 columns]

In [13]:
df.isna().sum()

Income                 0
Age                    0
Experience             0
Marital Status         0
House_Ownership        0
Car_Ownership          0
Profession             0
City                   0
State                  0
Current_Job_Years      0
Current_House_Years    0
Risk_Flag              0
dtype: int64